export const emojis = [
    "😀", "😁", "😂", "🤣", "😃", "😄", "😅", "😆", "😉", "😊",
    "😋", "😎", "😍", "😘", "😗", "😙", "😚", "🙂", "🤗", "🤩",
    "🤔", "🤨", "😐", "😑", "😶", "🙄", "😏", "😣", "😥", "😮",
    "🤐", "😯", "😪", "😫", "😴", "😌", "😛", "😜", "😝", "🤤",
    "😒", "😓", "😔", "😕", "🙃", "🤑", "😲", "☹️", "🙁", "😖",
    "😞", "😟", "😤", "😢", "😭", "😦", "😧", "😨", "😩", "🤯",
    "😬", "😰", "😱", "🥵", "🥶", "😳", "🤪", "😵", "😡", "😠",
    "🤬", "😷", "🤒", "🤕", "🤢", "🤮", "🤧", "😇", "🥰", "🤭",
    "🤫", "🤥", "😽", "🙀", "😿", "😾", "🤖", "🎃", "👽", "💩",
    "🔥", "✨", "🌈", "⭐", "💯", "👻", "😺", "😸", "😹", "😻"
];

export function stringToEmoji(str: string) {
    let hash = 0;
    for (let i = 0; i < str.length; i++) {
        hash ^= str.charCodeAt(i); // XOR по всем символам
        hash = (hash * 31) & 0xffffffff; // Умножаем на 31, чтобы усилить распределение
    }
    return emojis[Math.abs(hash) % emojis.length];
}